app/views/dashboard/index.html.erb

SELECT COUNT(*) FROM `groups` WHERE `groups`.`user_id` = 5
SELECT `groups`.* FROM `groups` WHERE `groups`.`user_id` = 5
---
						<div class="stat" >
							<span><%=@current_user.groups.count%></span>

SELECT COUNT(*) FROM `blogs` INNER JOIN `groups` ON `blogs`.`group_id` = `groups`.`id` WHERE `groups`.`user_id` = 5
---
						<div class="stat" >
							<span><%=@current_user.blogs.count%></span>

SELECT `tasks`.* FROM `tasks` INNER JOIN `tasks_users` ON `tasks`.`id` = `tasks_users`.`task_id` WHERE `tasks_users`.`user_id` = 5
---
						<div class="stat" >
							<span><%=@current_user.tasks.size%></span>

SELECT COUNT(*) FROM `blogs` WHERE `blogs`.`group_id` = 2
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`group_id` = 2
---
							<tbody>
							 <%for j in (0..@current_user.groups[i].blogs.size-1) %>