app/views/dashboard/tasks.html.erb

SELECT `tasks`.* FROM `tasks` INNER JOIN `tasks_users` ON `tasks`.`id` = `tasks_users`.`task_id` WHERE `tasks_users`.`user_id` = 5
---
							<tbody>
							 <%for i in (0..@current_user.tasks.size-1) %>

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1
---
									<%end%>
									<td><%= Group.find(@current_user.tasks[i].grp_id).name%></td>
									<% task_user = User.find(@current_user.tasks[i].usr_id) %>