app/controllers/blog_controller.rb

	def group
		group = Group.new(params[:group])
		if group.save
---
INSERT INTO `groups` (`created_at`, `description`, `name`, `updated_at`, `user_id`) VALUES ('2012-08-13 08:19:15', NULL, 'Exercise', '2012-08-13 08:19:15', NULL)

				task = Task.create(:usr_id => @current_user.id, :grp_id => params[:grp_id], :qty => params[:qty], :status => "processing", :action => 'create_blog')
---
INSERT INTO `tasks` (`action`, `blg_id`, `created_at`, `domain`, `grp_id`, `qty`, `status`, `updated_at`, `usr_id`) VALUES ('create_blog', NULL, '2012-08-24 23:51:26', NULL, '8', '1', 'processing', '2012-08-24 23:51:26', 6)

	def new
		@blog = Blog.find(params[:id])
		if @current_user.blogs.include? @blog
---
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
SELECT 1 FROM `blogs` INNER JOIN `groups` ON `blogs`.`group_id` = `groups`.`id` WHERE `groups`.`user_id` = 5 AND `blogs`.`id` = 1 LIMIT 1

	def post
		@blog = Blog.find(params[:id])
		if @current_user.blogs.include? @blog
---
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
SELECT 1 FROM `blogs` INNER JOIN `groups` ON `blogs`.`group_id` = `groups`.`id` WHERE `groups`.`user_id` = 5 AND `blogs`.`id` = 1 LIMIT 1

	def configure
		@blog = Blog.find(params[:id])
		if @current_user.blogs.include? @blog
---
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
SELECT 1 FROM `blogs` INNER JOIN `groups` ON `blogs`.`group_id` = `groups`.`id` WHERE `groups`.`user_id` = 5 AND `blogs`.`id` = 1 LIMIT 1

	def update
		#Save blog user & password

		blog = Blog.find(params[:blog_id])
	  if @current_user.blogs.include? blog
---
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
SELECT 1 FROM `blogs` INNER JOIN `groups` ON `blogs`.`group_id` = `groups`.`id` WHERE `groups`.`user_id` = 5 AND `blogs`.`id` = 1 LIMIT 1

			task = Task.create(:usr_id => @current_user.id, :grp_id => blog.group_id, :blg_id => blog.id, :domain => params[:custom_domain], :status => "processing", :action => 'add_domain')
			@current_user.tasks << task
			@super_admin.tasks << task if !@current_user.eql? @super_admin
			UserMailer.task_email(@current_user, task).deliver
		end

		blog.custom_domain = params[:custom_domain]
		if blog.save
---
INSERT INTO `tasks` (`action`, `blg_id`, `created_at`, `domain`, `grp_id`, `qty`, `status`, `updated_at`, `usr_id`) VALUES ('add_domain', 1, '2012-08-22 03:25:34', 'getcommify.com', 2, NULL, 'processing', '2012-08-22 03:25:34', 5)
UPDATE `blogs` SET `username` = 'U2FsdGVkX1+EGWhKVvwVOVx/AZgMcw0u8rPzOVs9bkw=\n', `password` = 'U2FsdGVkX18zn0lUHwwzWe5kvm/ZQpf54yByGPxl6AQ=\n', `custom_domain` = '', `updated_at` = '2012-08-16 08:48:05' WHERE `blogs`.`id` = 1