app/controllers/login_controller.rb

INSERT INTO `users` (`active`, `created_at`, `email`, `first_name`, `last_name`, `password`, `plan_id`, `subscr_id`, `super_admin`, `updated_at`, `username`) VALUES (NULL, '2012-08-20 21:27:14', 'tester123@gmail.com', 'Test', 'User', 'chapel080', NULL, NULL, NULL, '2012-08-20 21:27:14', 'test.user')
---
  def create

  	 @user = User.new(params[:user])
  	 if @user.save