app/controllers/task_controller.rb

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 2 LIMIT 1
---
		task = Task.find(params[:id])

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1
---
	def run
		@task = Task.find(params[:id])

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 5 LIMIT 1
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
UPDATE `tasks` SET `status` = 'completed', `updated_at` = '2012-08-22 03:26:43' WHERE `tasks`.`id` = 6
---
	def add_domain

		puts request.env["HTTP_REFERER"]
		logger.debug request.env["HTTP_REFERER"]
		@task = Task.find(params[:id])
		domains = Array.new
		domains << domain_name(@task.domain)
		domains << "www.#{domain_name(@task.domain)}"
		@previous_path = current_path
		switch_path("#{current_path}/custom_wordpress")

		begin
			#> Login to Heroku
			heroku_login("ngrichyj4@gmail.com", "XXXXX")

			#> TODO: Implement add heroku domain
			heroku_add_domain(domains,Domainatrix.parse("#{Blog.find(@task.blg_id).url}").subdomain)
			#> When done switch path to previous
			switch_path(@previous_path)
			#> Update task status
			@task.status = "completed"
			@task.save

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 4 LIMIT 1
UPDATE `tasks` SET `status` = 'completed', `qty` = 0, `updated_at` = '2012-08-23 00:32:34' WHERE `tasks`.`id` = 1
---
	def create_blog
		@task = Task.find(params[:id])

		@previous_path = current_path
		switch_path("#{current_path}/custom_wordpress")
	if @task.qty.to_i > 0
		begin
			#Login to Heroku
			heroku_login("ngrichyj4@gmail.com", "XXXXX")

			#> Create heroku blog
			@task.qty.to_i.times do
				heroku_create(RandomWord.adjs.next, @task.grp_id)
			end

			#> When done switch path to previous
			switch_path(@previous_path)

			#> Keep alive blogs
			blog_urls = return_blogs
			logger.debug("Added #{blog_urls} to heroku_keepalive")
			push_logs("Added #{blog_urls} to heroku_keepalive")

			heroku_keepalive(blog_urls)

			#> Update task status
			@task.status = "completed"
			@task.qty = 0
			@task.save