app/controllers/user_controller.rb

  def update
  	@current_user.first_name = params[:user][:first_name]
  	@current_user.last_name = params[:user][:last_name]
  	@current_user.email = params[:user][:email]


  	if !params[:user][:password].eql? "password"
  		@current_user.password = Digest::SHA1.hexdigest(params[:user][:password])
  	end
  	if @current_user.save
---
UPDATE `users` SET `first_name` = 'Rick', `password` = '42b5f44399cb03470bf64a5ed3ba93e1cce20c20', `updated_at` = '2012-08-13 21:55:46' WHERE `users`.`id` = 5