app/views/blog/configure.html.erb

						<div class="controls" >
							<input type="text" name="username" class="" value="<%=decrypt(@blog.username, @blog.group.user.email) if @blog.username%>" id="username" />
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 2 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'ngrichyj4' LIMIT 1